devdnl/dnx-rtos/src/system/drivers/spi/stm32fx/spi_lld.c
/*==============================================================================
File    spi_lld.c

Author  Daniel Zorychta

Brief   SPI driver.

        Copyright (C) 2017 Daniel Zorychta <daniel.zorychta@gmail.com>

        This program is free software; you can redistribute it and/or modify
        it under the terms of the GNU General Public License as published by
        the Free Software Foundation and modified by the dnx RTOS exception.

        NOTE: The modification  to the GPL is  included to allow you to
              distribute a combined work that includes dnx RTOS without
              being obliged to provide the source  code for proprietary
              components outside of the dnx RTOS.

        The dnx RTOS  is  distributed  in the hope  that  it will be useful,
        but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
        MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
        GNU General Public License for more details.

        Full license text is available on the following file: doc/license.txt.

==============================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "spi_cfg.h"
#include "../spi_ioctl.h"
#include "../spi.h"

#if defined(ARCH_stm32f1)
#include "stm32f1/stm32f10x.h"
#include "stm32f1/dma_ddi.h"
#elif defined(ARCH_stm32f4)
#include "stm32f4/stm32f4xx.h"
#include "stm32f4/dma_ddi.h"
#elif defined(ARCH_stm32f7)
#include "stm32f7/stm32f7xx.h"
#include "stm32f7/dma_ddi.h"
#define SPI_CR1_DFF SPI_CR1_CRCL
#endif

/*==============================================================================
  Local macros
==============================================================================*/
#define USE_DMA         (( (_SPI1_USE_DMA > 0) || (_SPI2_USE_DMA > 0)\
                        || (_SPI3_USE_DMA > 0) || (_SPI4_USE_DMA > 0)\
                        || (_SPI5_USE_DMA > 0) || (_SPI6_USE_DMA > 0))\
                        && __ENABLE_DMA__)

/*==============================================================================
  Local object types
==============================================================================*/
/* SPI peripheral configuration */
struct SPI_info {
        SPI_TypeDef             *const SPI;             //!< SPI peripheral address
        __IO u32_t              *APBRSTR;               //!< APB reset register address
        __IO u32_t              *APBENR;                //!< APB enable register
        u32_t                    APBRSTRENR;            //!< APB reset/enable bit
        IRQn_Type                IRQn;                  //!< SPI IRQ number
    #if USE_DMA > 0
        bool                     use_DMA;               //!< peripheral uses DMA and IRQ (true), or only IRQ (false)
        u8_t                     DMA_channel;           //!< DMA peripheral request channel number
        u8_t                     DMA_major;             //!< DMA peripheral number
        u8_t                     DMA_tx_stream_pri;     //!< primary Tx stream number
        u8_t                     DMA_tx_stream_alt;     //!< alternative Tx stream number
        u8_t                     DMA_rx_stream_pri;     //!< primary Rx stream number
        u8_t                     DMA_rx_stream_alt;     //!< alternative Rx stream number
    #endif
};

/*==============================================================================
  Local function prototypes
==============================================================================*/
#if USE_DMA > 0
#if defined(ARCH_stm32f1)
static bool DMA_callback(DMA_Channel_TypeDef *stream, u8_t SR, void *arg);
#elif defined(ARCH_stm32f4) || defined(ARCH_stm32f7)
static bool DMA_callback(DMA_Stream_TypeDef *stream, u8_t SR, void *arg);
#endif
#endif

/*==============================================================================
  Local objects
==============================================================================*/
/* SPI peripherals basic parameters */
static const struct SPI_info SPI_HW[_NUMBER_OF_SPI_PERIPHERALS] = {
#if defined(ARCH_stm32f1)
        #if defined(RCC_APB2ENR_SPI1EN)
        {
                .SPI                   = SPI1,
                .APBENR                = &RCC->APB2ENR,
                .APBRSTR               = &RCC->APB2RSTR,
                .APBRSTRENR            = RCC_APB2ENR_SPI1EN,
                .IRQn                  = SPI1_IRQn,
                #if USE_DMA > 0
                .use_DMA               = _SPI1_USE_DMA,
                .DMA_tx_stream_pri     = 3,
                .DMA_tx_stream_alt     = UINT8_MAX,
                .DMA_rx_stream_pri     = 2,
                .DMA_rx_stream_alt     = UINT8_MAX,
                .DMA_major             = _DMA_DDI_DMA1,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_SPI2EN)
        {
                .SPI                   = SPI2,
                .APBENR                = &RCC->APB1ENR,
                .APBRSTR               = &RCC->APB1RSTR,
                .APBRSTRENR            = RCC_APB1ENR_SPI2EN,
                .IRQn                  = SPI2_IRQn,
                #if USE_DMA > 0
                .use_DMA               = _SPI2_USE_DMA,
                .DMA_tx_stream_pri     = 5,
                .DMA_tx_stream_alt     = UINT8_MAX,
                .DMA_rx_stream_pri     = 4,
                .DMA_rx_stream_alt     = UINT8_MAX,
                .DMA_major             = _DMA_DDI_DMA1,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_SPI3EN)
        {
                .SPI                   = SPI3,
                .APBENR                = &RCC->APB1ENR,
                .APBRSTR               = &RCC->APB1RSTR,
                .APBRSTRENR            = RCC_APB1ENR_SPI3EN,
                .IRQn                  = SPI3_IRQn,
                #if USE_DMA > 0
                .use_DMA               = _SPI3_USE_DMA,
                .DMA_tx_stream_pri     = 2,
                .DMA_tx_stream_alt     = UINT8_MAX,
                .DMA_rx_stream_pri     = 1,
                .DMA_rx_stream_alt     = UINT8_MAX,
                .DMA_major             = _DMA_DDI_DMA2,
                #endif
        }
        #endif
#elif defined(ARCH_stm32f4) || defined(ARCH_stm32f7)
        #if defined(RCC_APB2ENR_SPI1EN)
        {
                .SPI                    = SPI1,
                .APBENR                 = &RCC->APB2ENR,
                .APBRSTR                = &RCC->APB2RSTR,
                .APBRSTRENR             = RCC_APB2ENR_SPI1EN,
                .IRQn                   = SPI1_IRQn,
                #if USE_DMA > 0
                .use_DMA                = _SPI1_USE_DMA,
                .DMA_tx_stream_pri      = 3,
                .DMA_tx_stream_alt      = 5,
                .DMA_rx_stream_pri      = 0,
                .DMA_rx_stream_alt      = 2,
                .DMA_channel            = 3,
                .DMA_major              = _DMA_DDI_DMA2,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_SPI2EN)
        {
                .SPI                    = SPI2,
                .APBENR                 = &RCC->APB1ENR,
                .APBRSTR                = &RCC->APB1RSTR,
                .APBRSTRENR             = RCC_APB1ENR_SPI2EN,
                .IRQn                   = SPI2_IRQn,
                #if USE_DMA > 0
                .use_DMA                = _SPI2_USE_DMA,
                .DMA_tx_stream_pri      = 4,
                .DMA_tx_stream_alt      = 4,
                .DMA_rx_stream_pri      = 3,
                .DMA_rx_stream_alt      = 3,
                .DMA_channel            = 0,
                .DMA_major              = _DMA_DDI_DMA1,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_SPI3EN)
        {
                .SPI                    = SPI3,
                .APBENR                 = &RCC->APB1ENR,
                .APBRSTR                = &RCC->APB1RSTR,
                .APBRSTRENR             = RCC_APB1ENR_SPI3EN,
                .IRQn                   = SPI3_IRQn,
                #if USE_DMA > 0
                .use_DMA                = _SPI3_USE_DMA,
                .DMA_tx_stream_pri      = 5,
                .DMA_tx_stream_alt      = 7,
                .DMA_rx_stream_pri      = 0,
                .DMA_rx_stream_alt      = 2,
                .DMA_channel            = 0,
                .DMA_major              = _DMA_DDI_DMA1,
                #endif
        },
        #endif
        #if defined(RCC_APB2ENR_SPI4EN)
        {
                .SPI                    = SPI4,
                .APBENR                 = &RCC->APB2ENR,
                .APBRSTR                = &RCC->APB2RSTR,
                .APBRSTRENR             = RCC_APB2ENR_SPI4EN,
                .IRQn                   = SPI4_IRQn,
                #if USE_DMA > 0
                .use_DMA                = _SPI4_USE_DMA,
                .DMA_tx_stream_pri      = 1,
                .DMA_tx_stream_alt      = 1,
                .DMA_rx_stream_pri      = 0,
                .DMA_rx_stream_alt      = 0,
                .DMA_channel            = 4,
                .DMA_major              = _DMA_DDI_DMA2,
                #endif
        },
        #endif
        #if defined(RCC_APB2ENR_SPI5EN)
        {
                .SPI                    = SPI5,
                .APBENR                 = &RCC->APB2ENR,
                .APBRSTR                = &RCC->APB2RSTR,
                .APBRSTRENR             = RCC_APB2ENR_SPI5EN,
                .IRQn                   = SPI5_IRQn,
                #if USE_DMA > 0
                .use_DMA                = _SPI5_USE_DMA,
                .DMA_tx_stream_pri      = 4,
                .DMA_tx_stream_alt      = 4,
                .DMA_rx_stream_pri      = 3,
                .DMA_rx_stream_alt      = 3,
                .DMA_channel            = 2,
                .DMA_major              = _DMA_DDI_DMA2,
                #endif
        },
        #endif
        #if defined(RCC_APB2ENR_SPI6EN)
        {
                .SPI                    = SPI6,
                .APBENR                 = &RCC->APB2ENR,
                .APBRSTR                = &RCC->APB2RSTR,
                .APBRSTRENR             = RCC_APB2ENR_SPI6EN,
                .IRQn                   = SPI6_IRQn,
                #if USE_DMA > 0
                .use_DMA                = _SPI6_USE_DMA,
                .DMA_tx_stream_pri      = 5,
                .DMA_tx_stream_alt      = 5,
                .DMA_rx_stream_pri      = 6,
                .DMA_rx_stream_alt      = 6,
                .DMA_channel            = 1,
                .DMA_major              = _DMA_DDI_DMA2,
                #endif
        },
        #endif
#endif
};

/*==============================================================================
  Exported objects
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Function enable SPI interface
 * @param[in] major     SPI major number
 * @return One of errno value.
 */
//==============================================================================
int _SPI_LLD__turn_on(u8_t major)
{
        if (!(*SPI_HW[major].APBENR & SPI_HW[major].APBRSTRENR)) {

                SET_BIT(*SPI_HW[major].APBRSTR, SPI_HW[major].APBRSTRENR);
                CLEAR_BIT(*SPI_HW[major].APBRSTR, SPI_HW[major].APBRSTRENR);
                SET_BIT(*SPI_HW[major].APBENR, SPI_HW[major].APBRSTRENR);

                NVIC_EnableIRQ(SPI_HW[major].IRQn);
                NVIC_SetPriority(SPI_HW[major].IRQn, _CPU_IRQ_SAFE_PRIORITY_);

                return ESUCC;
        } else {
                return EADDRINUSE;
        }
}

//==============================================================================
/**
 * @brief Function disable SPI interface
 * @param[in] major     SPI major number
 * @return None
 */
//==============================================================================
void _SPI_LLD__turn_off(u8_t major)
{
        if (*SPI_HW[major].APBENR & SPI_HW[major].APBRSTRENR) {
                SET_BIT(*SPI_HW[major].APBRSTR, SPI_HW[major].APBRSTRENR);
                CLEAR_BIT(*SPI_HW[major].APBRSTR, SPI_HW[major].APBRSTRENR);
                CLEAR_BIT(*SPI_HW[major].APBENR, SPI_HW[major].APBRSTRENR);

                NVIC_DisableIRQ(SPI_HW[major].IRQn);
        }
}

//==============================================================================
/**
 * @brief Function apply new configuration for selected SPI
 *
 * @param hdl           SPI slave
 */
//==============================================================================
void _SPI_LLD__apply_config(struct SPI_slave *hdl)
{
        static const u16_t divider_mask[] = {
                [SPI_CLK_DIV__2  ] = 0x00,
                [SPI_CLK_DIV__4  ] = SPI_CR1_BR_0,
                [SPI_CLK_DIV__8  ] = SPI_CR1_BR_1,
                [SPI_CLK_DIV__16 ] = SPI_CR1_BR_1 | SPI_CR1_BR_0,
                [SPI_CLK_DIV__32 ] = SPI_CR1_BR_2,
                [SPI_CLK_DIV__64 ] = SPI_CR1_BR_2 | SPI_CR1_BR_0,
                [SPI_CLK_DIV__128] = SPI_CR1_BR_2 | SPI_CR1_BR_1,
                [SPI_CLK_DIV__256] = SPI_CR1_BR_2 | SPI_CR1_BR_1 | SPI_CR1_BR_0,
        };

        static const u16_t spi_mode_mask[] = {
                [SPI_MODE__0] = 0x00,
                [SPI_MODE__1] = SPI_CR1_CPHA,
                [SPI_MODE__2] = SPI_CR1_CPOL,
                [SPI_MODE__3] = SPI_CR1_CPOL | SPI_CR1_CPHA
        };

        SPI_TypeDef *SPI = SPI_HW[hdl->major].SPI;

        /* clear register */
        WRITE_REG(SPI->CR1, 0);

        /* configure SPI divider */
        SET_BIT(SPI->CR1, divider_mask[hdl->config.clk_divider]);

        /* configure SPI mode */
        SET_BIT(SPI->CR1, spi_mode_mask[hdl->config.mode]);

        /* CRC 8-bit length */
        CLEAR_BIT(SPI->CR1, SPI_CR1_DFF);

        /* set MSB/LSB */
        if (hdl->config.msb_first) {
                CLEAR_BIT(SPI->CR1, SPI_CR1_LSBFIRST);
        } else {
                SET_BIT(SPI->CR1, SPI_CR1_LSBFIRST);
        }

        /* NSS software mode */
        SET_BIT(SPI->CR1, SPI_CR1_SSM | SPI_CR1_SSI);

        /* set SPI as master */
        SET_BIT(SPI->CR1, SPI_CR1_MSTR);

#if defined(ARCH_stm32f7)
        WRITE_REG(SPI->CR2, SPI_CR2_FRXTH | SPI_CR2_DS_2 | SPI_CR2_DS_1 | SPI_CR2_DS_0);
#endif

