devdnl/dnx-rtos/src/system/drivers/spi/stm32fx/spi_lld.c
        /* enable peripheral */
        SET_BIT(SPI->CR1, SPI_CR1_SPE);
}

//==============================================================================
/**
 * @brief Function apply SPI device safe configuration
 *
 * @param major         SPI major number
 */
//==============================================================================
void _SPI_LLD__halt(u8_t major)
{
        SPI_TypeDef *SPI = SPI_HW[major].SPI;

        while (SPI->SR & SPI_SR_BSY);

        CLEAR_BIT(SPI->CR1, SPI_CR1_SPE);
        SET_BIT(SPI->CR1, SPI_CR1_MSTR);
}

//==============================================================================
/**
 * @brief  Transceive data by using IRQs or DMA
 * @param  hdl          virtual SPI handler
 * @param  txbuf        source buffer (can be NULL for RX only)
 * @param  rxbuf        destination buffer (can be NULL for TX only)
 * @param  count        number of bytes to transfer
 * @return One of errno value
 */
//==============================================================================
int _SPI_LLD__transceive(struct SPI_slave *hdl, const u8_t *txbuf, u8_t *rxbuf, size_t count)
{
        int err = EIO;
        _SPI[hdl->major]->slave = hdl;

#if USE_DMA > 0
        bool dma_capable = true;

        if (  (count < 16)
           || (txbuf && !sys_is_mem_dma_capable(txbuf))
           || (rxbuf && !sys_is_mem_dma_capable(rxbuf)) ) {
                dma_capable = false;
        }

        // try to send/receive buffers by using DMA
        if (SPI_HW[hdl->major].use_DMA && dma_capable) {
                // reserve TX stream
                u32_t dmadtx = _DMA_DDI_reserve(SPI_HW[hdl->major].DMA_major,
                                                SPI_HW[hdl->major].DMA_tx_stream_pri);
                if (dmadtx == 0) {
                        dmadtx = _DMA_DDI_reserve(SPI_HW[hdl->major].DMA_major,
                                                  SPI_HW[hdl->major].DMA_tx_stream_alt);
                }

                // reserve RX stream
                u32_t dmadrx = _DMA_DDI_reserve(SPI_HW[hdl->major].DMA_major,
                                                SPI_HW[hdl->major].DMA_rx_stream_pri);
                if (dmadrx == 0) {
                        dmadrx = _DMA_DDI_reserve(SPI_HW[hdl->major].DMA_major,
                                                  SPI_HW[hdl->major].DMA_rx_stream_alt);
                }

                // configure channels
                if (dmadtx && dmadrx) {
                        CLEAR_BIT(SPI_HW[hdl->major].SPI->CR2, SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);

                        _SPI[hdl->major]->flush_byte = hdl->config.flush_byte;
                        _SPI[hdl->major]->count      = count;

                        _DMA_DDI_config_t config_tx = {0};
                        config_tx.user_ctx                     = NULL;
                        config_tx.cb_finish                    = NULL;
                        config_tx.cb_half                      = NULL;
                        config_tx.cb_next                      = NULL;
                        config_tx.data_number                  = count;
                        config_tx.peripheral_address           = cast(u32_t, &SPI_HW[hdl->major].SPI->DR);
#if defined(ARCH_stm32f1) || defined(ARCH_stm32f3)
                        config_tx.memory_address               = cast(u32_t, txbuf ? txbuf : &_SPI[hdl->major]->flush_byte);
#endif
                        config_tx.IRQ_priority                 = __CPU_DEFAULT_IRQ_PRIORITY__;
                        config_tx.release                      = true;
                        config_tx.priority_level               = _DMA_DDI_PRIORITY_LEVEL_LOW;
                        config_tx.memory_data_size             = _DMA_DDI_MEMORY_DATA_SIZE_BYTE;
                        config_tx.peripheral_data_size         = _DMA_DDI_PERIPHERAL_DATA_SIZE_BYTE;
                        config_tx.peripheral_address_increment = _DMA_DDI_PERIPHERAL_ADDRESS_POINTER_IS_FIXED;
                        config_tx.memory_address_increment     = (txbuf ? _DMA_DDI_MEMORY_ADDRESS_POINTER_INCREMENTED : _DMA_DDI_MEMORY_ADDRESS_POINTER_IS_FIXED);
                        config_tx.circular_mode                = _DMA_DDI_CIRCULAR_MODE_DISABLED;
                        config_tx.transfer_direction           = _DMA_DDI_TRANSFER_DIRECTION_MEMORY_TO_PERIPHERAL;
#if defined(ARCH_stm32f4) || defined(ARCH_stm32f7)
                        config_tx.memory_burst                 = _DMA_DDI_MEMORY_BURST_SINGLE_TRANSFER;
                        config_tx.peripheral_burst             = _DMA_DDI_PERIPHERAL_BURST_SINGLE_TRANSFER;
                        config_tx.double_buffer_mode           = _DMA_DDI_DOUBLE_BUFFER_MODE_DISABLED;
                        config_tx.peripheral_increment_offset  = _DMA_DDI_PERIPHERAL_INCREMENT_OFFSET_ACCORDING_TO_PERIPHERAL_SIZE;
                        config_tx.flow_controller              = _DMA_DDI_FLOW_CONTROLLER_DMA;
                        config_tx.channel                      = SPI_HW[hdl->major].DMA_channel;
                        config_tx.mode                         = _DMA_DDI_MODE_FIFO;
                        config_tx.fifo_threshold               = _DMA_DDI_FIFO_THRESHOLD_FULL;
                        config_tx.memory_address[0]            = cast(u32_t, txbuf ? txbuf : &_SPI[hdl->major]->flush_byte);
                        config_tx.memory_address[1]            = 0;
#endif

                        _DMA_DDI_config_t config_rx = {0};
                        config_rx.user_ctx                     = hdl;
                        config_rx.cb_finish                    = DMA_callback;
                        config_rx.cb_half                      = NULL;
                        config_rx.cb_next                      = NULL;
                        config_rx.data_number                  = count;
                        config_rx.peripheral_address           = cast(u32_t, &SPI_HW[hdl->major].SPI->DR);
#if defined(ARCH_stm32f1) || defined(ARCH_stm32f3)
                        config_rx.memory_address               = cast(u32_t, rxbuf ? rxbuf : &_SPI[hdl->major]->flush_byte);
#endif
                        config_rx.IRQ_priority                 = __CPU_DEFAULT_IRQ_PRIORITY__;
                        config_rx.release                      = true;
                        config_rx.priority_level               = _DMA_DDI_PRIORITY_LEVEL_LOW;
                        config_rx.memory_address_increment     = (rxbuf ? _DMA_DDI_MEMORY_ADDRESS_POINTER_INCREMENTED : _DMA_DDI_MEMORY_ADDRESS_POINTER_IS_FIXED);
                        config_rx.memory_data_size             = _DMA_DDI_MEMORY_DATA_SIZE_BYTE;
                        config_rx.peripheral_data_size         = _DMA_DDI_PERIPHERAL_DATA_SIZE_BYTE;
                        config_rx.peripheral_address_increment = _DMA_DDI_PERIPHERAL_ADDRESS_POINTER_IS_FIXED;
                        config_rx.circular_mode                = _DMA_DDI_CIRCULAR_MODE_DISABLED;
                        config_rx.transfer_direction           = _DMA_DDI_TRANSFER_DIRECTION_PERIPHERAL_TO_MEMORY;
#if defined(ARCH_stm32f4) || defined(ARCH_stm32f7)
                        config_rx.peripheral_increment_offset  = _DMA_DDI_PERIPHERAL_INCREMENT_OFFSET_ACCORDING_TO_PERIPHERAL_SIZE;
                        config_rx.memory_burst                 = _DMA_DDI_MEMORY_BURST_SINGLE_TRANSFER;
                        config_rx.peripheral_burst             = _DMA_DDI_PERIPHERAL_BURST_SINGLE_TRANSFER;
                        config_rx.double_buffer_mode           = _DMA_DDI_DOUBLE_BUFFER_MODE_DISABLED;
                        config_rx.flow_controller              = _DMA_DDI_FLOW_CONTROLLER_DMA;
                        config_rx.mode                         = _DMA_DDI_MODE_FIFO;
                        config_rx.fifo_threshold               = _DMA_DDI_FIFO_THRESHOLD_1_2;
                        config_rx.channel                      = SPI_HW[hdl->major].DMA_channel;
                        config_rx.memory_address[0]            = cast(u32_t, rxbuf ? rxbuf : &_SPI[hdl->major]->flush_byte);
                        config_rx.memory_address[1]            = 0;
#endif
                        err = _DMA_DDI_transfer(dmadrx, &config_rx);
                        if (!err) {
                                err = _DMA_DDI_transfer(dmadtx, &config_tx);
                                if (!err) {
                                        SET_BIT(SPI_HW[hdl->major].SPI->CR2, SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);

                                        err = sys_semaphore_wait(_SPI[hdl->major]->wait_irq_sem,
                                                                 _SPI_IRQ_WAIT_TIMEOUT);

                                        _DMA_DDI_release(dmadtx);
                                        _DMA_DDI_release(dmadrx);
                                }
                        }

