devdnl/dnx-rtos/src/system/drivers/spi/stm32fx/spi_lld.c
                        return err;
                } else {
                        _DMA_DDI_release(dmadtx);
                        _DMA_DDI_release(dmadrx);
                }
        }
#endif

        // send/receive buffers by using IRQs
        _SPI[hdl->major]->tx_buffer  = txbuf;
        _SPI[hdl->major]->rx_buffer  = rxbuf;
        _SPI[hdl->major]->count      = count;
        _SPI[hdl->major]->flush_byte = hdl->config.flush_byte;

        SET_BIT(SPI_HW[hdl->major].SPI->CR2, SPI_CR2_TXEIE);

        err = sys_semaphore_wait(_SPI[hdl->major]->wait_irq_sem, _SPI_IRQ_WAIT_TIMEOUT);

        return err;
}

//==============================================================================
/**
 * @brief  Function handle SPI IRQ
 * @param  major        SPI device number
 * @return If task was woken then true is returned, otherwise false
 */
//==============================================================================
static void handle_SPI_IRQ(u8_t major)
{
        bool         woken = false;
        SPI_TypeDef *spi   = SPI_HW[major].SPI;

        /* transmit data by using Tx register */
        if ((spi->SR & SPI_SR_TXE) && (spi->CR2 & SPI_CR2_TXEIE)) {

                if (_SPI[major]->count > 0) {
                        if (_SPI[major]->tx_buffer) {
                                u8_t byte = *(_SPI[major]->tx_buffer++);
#if defined(ARCH_stm32f7)
                                uint8_t *DR = (uint8_t*)&spi->DR;
                                *DR = byte;
#else
                                spi->DR = byte;
#endif
                        } else {
                                u8_t byte = _SPI[major]->flush_byte;
#if defined(ARCH_stm32f7)
                                uint8_t *DR = (uint8_t*)&spi->DR;
                                *DR = byte;
#else
                                spi->DR = byte;
#endif
                        }
                }

                SET_BIT(spi->CR2, SPI_CR2_RXNEIE);
                CLEAR_BIT(spi->CR2, SPI_CR2_TXEIE);
        }

        /* receive data from RX register */
        if ((spi->SR & SPI_SR_RXNE) && (spi->CR2 & SPI_CR2_RXNEIE)) {
                u8_t byte = spi->DR;

                if (_SPI[major]->count > 0) {
                        if (_SPI[major]->rx_buffer) {
                                *(_SPI[major]->rx_buffer++) = byte;
                        }

                        _SPI[major]->count--;
                }

                SET_BIT(spi->CR2, SPI_CR2_TXEIE);
        }

        /* finish transmission if all frames are received and transmitted */
        if (_SPI[major]->count == 0) {
                CLEAR_BIT(spi->CR2, SPI_CR2_RXNEIE);
                CLEAR_BIT(spi->CR2, SPI_CR2_TXEIE);
                sys_semaphore_signal_from_ISR(_SPI[major]->wait_irq_sem, &woken);
        }

        sys_thread_yield_from_ISR(woken);
}

#if USE_DMA > 0
//==============================================================================
/**
 * @brief  DMA IRQ handler
 * @param  stream       DMA stream/channel
 * @param  major        SPI major number
 * @return If task was woken then true is returned, otherwise false
 */
//==============================================================================
#if defined(ARCH_stm32f1)
static bool DMA_callback(DMA_Channel_TypeDef *stream, u8_t SR, void *arg)
#elif defined(ARCH_stm32f4) || defined(ARCH_stm32f7)
static bool DMA_callback(DMA_Stream_TypeDef *stream, u8_t SR, void *arg)
#endif
{
        UNUSED_ARG2(stream, SR);

        struct SPI_slave *hdl = arg;

        CLEAR_BIT(SPI_HW[hdl->major].SPI->CR2, SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);

        bool woken = false;
        sys_semaphore_signal_from_ISR(_SPI[hdl->major]->wait_irq_sem, &woken);

        return woken;
}
#endif

#if defined(RCC_APB2ENR_SPI1EN)
//==============================================================================
/**
 * @brief SPI1 IRQ handler
 */
//==============================================================================
void SPI1_IRQHandler(void)
{
        handle_SPI_IRQ(_SPI1);
}
#endif

//==============================================================================

#if defined(RCC_APB1ENR_SPI2EN)
//==============================================================================
/**
 * @brief SPI2 IRQ handler
 */
//==============================================================================
void SPI2_IRQHandler(void)
{
        handle_SPI_IRQ(_SPI2);
}
#endif

#if defined(RCC_APB1ENR_SPI3EN)
//==============================================================================
/**
 * @brief SPI3 IRQ handler
 */
//==============================================================================
void SPI3_IRQHandler(void)
{
        handle_SPI_IRQ(_SPI3);
}
#endif

#if defined(RCC_APB2ENR_SPI4EN)
//==============================================================================
/**
 * @brief SPI4 IRQ handler
 */
//==============================================================================
void SPI4_IRQHandler(void)
{
        handle_SPI_IRQ(_SPI4);
}
#endif

#if defined(RCC_APB2ENR_SPI5EN)
//==============================================================================
/**
 * @brief SPI5 IRQ handler
 */
//==============================================================================
void SPI5_IRQHandler(void)
{
        handle_SPI_IRQ(_SPI5);
}
#endif

#if defined(RCC_APB2ENR_SPI6EN)
//==============================================================================
/**
 * @brief SPI6 IRQ handler
 */
//==============================================================================
void SPI6_IRQHandler(void)
{
        handle_SPI_IRQ(_SPI6);
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
